#СОЗДАЕМ ВЕЧНЫЙ ЦИКЛ
while True:
	#ДЛЯ ИЗБЕЖАНИЯ ОШИБОК
	try:
		#ВВОДИМ КООРДИНАТЫ ПЕРВОЙ ТОЧКИ
		a_1 = int(input("Введите номер столбца: "))
		b_1 = int(input("Введите номер строки:  "))

		#ВВОДИМ КООРДИНАТЫ ВТОРОЙ ТОЧКИ
		a_2 = int(input("Введите номер столбца: "))
		b_2 = int(input("Введите номер строки:  "))

		#ЕСЛИ ПОКРАШЕНЫ В ОДИН ЦВЕТ ТО YES, ЕСЛИ В РАЗНЫЕ ТО NO
		#ЕСЛИ СУММА ВСЕХ ЦИФР КРАТНА 2, ТО ЦВЕТА ОДИНАКОВЫЕ
		if (a_1 + b_1 + a_2 + b_2) % 2 == 0:
		    print('YES')
		else:
		    print('NO')

	#ВЫВОД ТЕКСТА ПОДСКАЗКИ
	except ValueError:
		print("Нужно ввести целое число")
