#СОЗДАЕМ ВЕЧНЫЙ ЦИКЛ
while True:
	#ДЛЯ ИЗБЕЖАНИЯ ОШИБОК
	try:
		list = []
		
		print("----------------------------------------------------------------------")
		a = float(input("Число: "))
		b = 0 #Переменная для сравнения 
		print("----------------------------------------------------------------------")

		while b <= a:
			c = int(input("Введите число: "))
			b += 1 #Равносильно b = b + 1 // СЧЕТЧИК
			list.append(c)

			sequence.count(x)

			print(list)

			if(b == a):
				print("Работа программы завершена")
				print("----------------------------------------------------------------------")		
				break

	except ValueError:
    	   	print("----------------------------------------------------------------------")
       		print("Введите корректные данные!")
       		print("----------------------------------------------------------------------")