#СОЗДАЕМ ВЕЧНЫЙ ЦИКЛ
while True:
	#ДЛЯ ИЗБЕЖАНИЯ ОШИБОК
	try:
		N = int(input("Введите длину бассейна:  "))
		M = int(input("Введите ширину бассейна: "))
		x = int(input("На каком расстоянии находится от длинных бортиков?: "))
		y = int(input("На каком расстоянии находится от коротких бортиков?:"))
		
		
		if N > M:
   	 		N, M = M, N #N = M, N = N, M = N, M = M
		if x >= N / 2:
		    x = N - x
		if y >= M / 2:
		    y = M - y
		if x < y:
			
		    print(x)
		else:
		    print(y)
			


	#ВЫВОД ТЕКСТА ПОДСКАЗКИ
	except ValueError:
		print("Нужно ввести целое число")
